nusschAngE/stm32h7xx/hardware/flash/qspi_flash.c

#include "stm32h7xx.h"
#include "qspi_flash.h"
#include "delay.h"

/********* W25Qxxx command ***********/
/* write enable/disable cmd */
#define W25Q_WRITE_ENABLE     0x06
#define W25Q_WRITE_ENVSR      0x50//volatile status register
#define W25Q_WRITE_DISABLE    0x04
/* read status register */
#define W25Q_READ_SR1         0x05
#define W25Q_READ_SR2         0x35
#define W25Q_READ_SR3         0x15
/* write status register */
#define W25Q_WRITE_SR1        0x01
#define W25Q_WRITE_SR2        0x31
#define W25Q_WRITE_SR3        0x11
/* read id */
#define W25Q_READID           0x90
#define W25Q_READID_DSPI      0x92
#define W25Q_READID_QSPI      0x94
/* QSPI Enable &Disable */
#define W25Q_QSPI_ENABLE      0x38
#define W25Q_QSPI_DISABLE     0xff
/* address mode */
#define W25Q_ADDR_3BYTE       0xe9
#define W25Q_ADDR_4BYTE       0xb7
/* fast read */
#define W25Q_FAST_READ        0x0b
#define W25Q_FAST_READ4B      0x0c
/* page program */
#define W25Q_PAGE_PROGRAM     0x02
/* sector erase */
#define W25Q_SECTOR_ERASE     0x20
/* set read parameter */
#define W25Q_READ_PARA         0xc0

/*******************  ***************************/

static uint8_t OPRBUFFER[QFLASH_SECTORSIZE];

SPIFlashDevice QFlash;
static QSPI_HandleTypeDef QSPI_Handler;

/*
*  W25Qxxx Status Registers 
*/
typedef enum
{
    W25Qxxx_SR1 = 0,
    W25Qxxx_SR2,
    W25Qxxx_SR3
}W25Qxxx_SR;

/*************** private function ***************/

static uint8_t w25qxxx_WriteEnable(void);
static uint8_t w25qxxx_WriteDisable(void);
static uint8_t w25qxxx_WriteEnableState(void);
static uint8_t w25qxxx_SetAddressMode(uint8_t mode);
static uint8_t w25qxxx_GetAddressMode(void);
static uint8_t w25qxxx_SetReadParameter(uint8_t dummy, uint8_t wrap);
static uint8_t w25qxxx_GetDeviceID(void);
static uint8_t w25qxxx_ReadSR(W25Qxxx_SR SRx, uint8_t *rVal);
static uint8_t w25qxxx_WriteSR(W25Qxxx_SR SRx, uint8_t wVal);
static uint8_t w25qxxx_QSPI_Enable(void);
static uint8_t w25qxxx_QSPI_Disable(void);
static uint8_t w25qxxx_WaitBusy(void);
static uint8_t w25qxxx_EraseSector(uint32_t sector);
static uint8_t w25qxxx_Read(uint8_t *pBuff, uint32_t Addr, uint16_t rSize);
static uint8_t w25qxxx_WritePage(uint32_t Addr, uint8_t *pBuff, uint16_t wSize);
//static uint8_t w25qxxx_WriteSector(uint8_t *pBuff, uint32_t Addr, uint16_t wSize, uint8_t check);

/*
*   QSPI send Command
*/
static uint8_t qspi_SendCommand(uint32_t Inst, uint32_t Addr, 
                                uint32_t dCycles, uint32_t InstMode, 
                                uint32_t AddrMode, uint32_t AddrSize, 
                                uint32_t DataMode)
{
    QSPI_CommandTypeDef Cmdhandler;
    
    Cmdhandler.Instruction = Inst;                 	
    Cmdhandler.Address = Addr;                            
    Cmdhandler.DummyCycles = dCycles;                   
    Cmdhandler.InstructionMode = InstMode;				
    Cmdhandler.AddressMode = AddrMode;   					
    Cmdhandler.AddressSize = AddrSize;   				
    Cmdhandler.DataMode = DataMode;             				
    Cmdhandler.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;       	
    Cmdhandler.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE; 
    Cmdhandler.DdrMode = QSPI_DDR_MODE_DISABLE;           	
    Cmdhandler.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    if(HAL_QSPI_Command(&QSPI_Handler, &Cmdhandler, 0xffff) != HAL_OK)
    {
        return F_OPR_ERR;
    }

    return F_OPR_OK;
}

static uint8_t qspi_Transmit(uint8_t *pBuff, uint32_t wSize)
{
    QSPI_Handler.Instance->DLR = wSize;
    if(HAL_QSPI_Transmit(&QSPI_Handler, pBuff, 0xff) == HAL_OK)
    {
        return F_SPI_OK;
    }
    return F_SPI_ERR;
}

static uint8_t qspi_Receive(uint8_t *pBuff, uint32_t rSize)
{
    QSPI_Handler.Instance->DLR = rSize;
    if(HAL_QSPI_Receive(&QSPI_Handler, pBuff, 0xff) == HAL_OK)
    {
        return F_SPI_OK;
    }
    return F_SPI_ERR;
}

/********************** W25Qxxx control ********************************/


static uint8_t w25qxxx_WriteEnable(void)
{
    uint8_t count = 10, tempSR = 0;
    uint8_t ret = F_OPR_ERR;

    /* QSPI send command */
    if(QFlash.SPIMode == F_SerialSPI)
    {
        ret = qspi_SendCommand(W25Q_WRITE_ENABLE, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_NONE);
    }
    else if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(W25Q_WRITE_ENABLE, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_NONE);
    }
    else
    {
        /* SPI mode not support */
        QFlash.bWrite = 0;
        return F_OPR_ErrSPI;
    }    

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);
            
    while(w25qxxx_WriteEnableState() == 0)
    {
        ShortDelay(100);
        if(--count == 0)
        {
           return F_OPR_ERR; 
        }
    }

    return F_OPR_OK;
}

static uint8_t w25qxxx_WriteDisable(void)
{
    uint8_t ret = F_OPR_ERR;
    
    /* QSPI send command */
    if(QFlash.SPIMode == F_SerialSPI)
    {
        ret = qspi_SendCommand(W25Q_WRITE_DISABLE, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(W25Q_WRITE_DISABLE, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        return F_OPR_ErrSPI;
    }

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);

    QFlash.bWrite = 0;
    return F_OPR_OK;
}

/* return current write enable or disable state */
static uint8_t w25qxxx_WriteEnableState(void)
{
    uint8_t tempSR = 0;
    uint8_t ret = 0;

    ret = w25qxxx_ReadSR(W25Qxxx_SR1, &tempSR);
    printf("w25qxxx_ReadSR, ret = %d, reg = 0x%02x\r\n", ret, tempSR);
    if(ret == F_OPR_OK)
    {
        if((tempSR & 0x02))
            QFlash.bWrite = 1;
        else
            QFlash.bWrite = 0;
    }  
    else
    {
        QFlash.bWrite = 0;
    }

