nusschAngE/stm32h7xx/hardware/flash/qspi_flash.c
    return (QFlash.bWrite);
}

static uint8_t w25qxxx_SetAddressMode(uint8_t mode)
{
    uint8_t temp = 0, ret = F_OPR_ERR;
    uint8_t count = 10;

    if(mode == F_ADDR_3B)
        temp = W25Q_ADDR_3BYTE;
    else if(mode == F_ADDR_4B)
        temp = W25Q_ADDR_4BYTE;
    else
        return W25Q_ADDR_3BYTE;

    /* QSPI send command */
    if(QFlash.SPIMode == F_SerialSPI)
    {
        ret = qspi_SendCommand(temp, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(temp, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        QFlash.AddressMode = F_ADDR_3B;
        return F_OPR_ErrSPI;
    }    

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);

    /* check current address mode */
    while(w25qxxx_GetAddressMode() != mode)
    {
        ShortDelay(100);
        if(--count == 0)
        {
            return F_OPR_ERR;
        }
    }

    return F_OPR_OK;
}

/* return current address mode */
static uint8_t w25qxxx_GetAddressMode(void)
{
    uint8_t tempSR = 0;
    if(w25qxxx_ReadSR(W25Qxxx_SR3, &tempSR) == F_OPR_OK)
    {
        if((tempSR & 0x01))
            QFlash.AddressMode = F_ADDR_4B;
        else
            QFlash.AddressMode = F_ADDR_3B;
    }
    else
    {
        QFlash.AddressMode = F_ADDR_3B;
    }

    return (QFlash.AddressMode);
}

/*
*   QSPI Only
*   dummy[bit5:4] 
*           0 -> 2dummy 40mhz
*           1 -> 4dummy 80mhz
*           2 -> 6dummy 104mhz
*           3 -> 8dummy 104mhz
*   wrap[bit1:0] 
*           0 -> 8byte
*           1 -> 16byte
*           2 -> 32byte
*           3 -> 64byte
*/
static uint8_t w25qxxx_SetReadParameter(uint8_t dummy, uint8_t wrap)
{
    uint8_t temp = 0, ret = F_OPR_ERR;
    
    /* QSPI send command */
    if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(W25Q_READ_PARA, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        return F_OPR_ErrSPI;
    }    

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);

    temp = wrap | dummy << 4;
    if(qspi_Transmit(&temp, 1) != F_SPI_OK)
    {
        return F_OPR_ERR;
    }

    return F_OPR_OK;
}

static uint8_t w25qxxx_GetDeviceID(void)
{
    uint8_t Recv[2];
    uint8_t ret = F_OPR_ERR;

    /* QSPI send command */
#if 0	
    if(QFlash.SPIMode == F_SerialSPI)
    {
        ret = qspi_SendCommand(W25Q_READID, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(W25Q_READID_QSPI, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_NONE, QSPI_ADDRESS_8_BITS, 
                                QSPI_DATA_4_LINES);
    }	
    else
    {
        /* SPI mode not support */
        QFlash.id = 0;
        return F_OPR_ErrSPI;
    }
#else
	ret = qspi_SendCommand(W25Q_READID, 0, 
                       		0, QSPI_INSTRUCTION_1_LINE, 
                        	QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                        	QSPI_DATA_1_LINE);
#endif

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);

    if(qspi_Receive(Recv, 2) == F_SPI_OK)
    {
        QFlash.id = (uint32_t)((Recv[0] << 8) | Recv[1]);
        return F_OPR_OK;
    }
    else
    {
        QFlash.id = 0;
        return F_OPR_ERR;
    }
}

static uint8_t w25qxxx_ReadSR(W25Qxxx_SR SRx, uint8_t *rVal)
{
    uint8_t Cmd = 0, Recv = 0;
    uint8_t ret = F_OPR_ERR;

    /* select command ready to sent */
    switch (SRx)
    {
        case W25Qxxx_SR1:
            Cmd = W25Q_READ_SR1;
            break;
        case W25Qxxx_SR2:
            Cmd = W25Q_READ_SR2;
            break;
        case W25Qxxx_SR3:
            Cmd = W25Q_READ_SR3;
            break; 
        default:
            Cmd = 0;
            return F_OPR_ErrCMD;
    }

    /* QSPI send command */
    if(QFlash.SPIMode == F_SerialSPI)
    {
        ret = qspi_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        *rVal = 0;
        return F_OPR_ErrSPI;
    }

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);

    if(qspi_Receive(&Recv, 1) == F_SPI_OK)
    {
        *rVal = Recv;
        return F_OPR_OK;
    }
    else
    {
        *rVal = 0;
        return F_OPR_ERR;
    }
}

static uint8_t w25qxxx_WriteSR(W25Qxxx_SR SRx, uint8_t wVal)
{
    uint8_t Cmd = 0;
    uint8_t ret = F_OPR_ERR;

    /* select command ready to sent */
    switch (SRx)
    {
        case W25Qxxx_SR1:
            Cmd = W25Q_WRITE_SR1;
            break;
        case W25Qxxx_SR2:
            Cmd = W25Q_WRITE_SR2;
            break;
        case W25Qxxx_SR3:
            Cmd = W25Q_WRITE_SR3;
            break; 
        default:
            Cmd = 0;
            return F_OPR_ErrCMD;
    }

    if(w25qxxx_WriteEnableState() == 0)//write disable
    {
        if(w25qxxx_WriteEnable() != F_OPR_OK)
        {
            return F_OPR_ErrWDIS;
        }
    }

    /* QSPI send command */
    if(QFlash.SPIMode == F_SerialSPI)
    {
        ret = qspi_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_1_LINE, 
                                QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_1_LINE);
    }
    else if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(Cmd, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
    }
    else
    {
        /* SPI mode not support */
        return F_OPR_ErrSPI;
    }

    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);

    if(qspi_Transmit(&wVal, 1) == F_SPI_OK)
        return F_OPR_OK;
    else
        return F_OPR_ERR;
}

