nusschAngE/stm32h7xx/hardware/flash/qspi_flash.c
static uint8_t w25qxxx_QSPI_Enable(void)
{
    uint8_t tempSR = 0;
    uint8_t ret = F_OPR_ERR;

    if(w25qxxx_WriteEnableState() == 0)//write disable
    {
        if(w25qxxx_WriteEnable() != F_OPR_OK)
        {
            return F_OPR_ErrWDIS;
        }
    }
    
    if(w25qxxx_ReadSR(W25Qxxx_SR2, &tempSR) == F_OPR_OK)
    {
        if((tempSR & 0x02) == 0)
        {
            /* QSPI enable */
            tempSR |= 0x02;
            if(w25qxxx_WriteSR(W25Qxxx_SR2, tempSR) != F_OPR_OK)
            {
                return F_OPR_ERR;
            }    
            
            ret = qspi_SendCommand(W25Q_QSPI_ENABLE, 0, 
                                    0, QSPI_INSTRUCTION_1_LINE, 
                                    QSPI_ADDRESS_1_LINE, QSPI_ADDRESS_24_BITS, 
                                    QSPI_DATA_1_LINE);
            /* send command error */ 
            if(ret != F_OPR_OK) return (F_OPR_ErrCMD);                        

            QFlash.SPIMode = F_SerialQUADSPI;
            return F_OPR_OK;
        }
		else
		{
			QFlash.SPIMode = F_SerialQUADSPI;
            return F_OPR_OK;
		}
    }
    else
    {
        QFlash.SPIMode = F_SerialNUM;
        return F_OPR_ERR;
    }
    
    return F_OPR_OK;
}

static uint8_t w25qxxx_QSPI_Disable(void)
{
    uint8_t ret = F_OPR_ERR;

    if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        ret = qspi_SendCommand(W25Q_QSPI_DISABLE, 0, 
                                0, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                                QSPI_DATA_4_LINES);
        /* send command error */ 
        if(ret != F_OPR_OK) return (F_OPR_ErrCMD);
    }
    
    QFlash.SPIMode = F_SerialSPI;
    return F_OPR_OK;
}

/* return busy status */
static uint8_t w25qxxx_WaitBusy(void)
{
    uint8_t tempSR = 0, busy = 1;
    uint16_t count = 0xff;
    uint8_t ret = F_OPR_ERR;

    while(busy)
    {
        /* busy flag in SR1->BIT0 */
        ret = w25qxxx_ReadSR(W25Qxxx_SR1, &tempSR);
        if(ret == F_OPR_OK)
        {
            if((tempSR & 0x01)) 
                busy = 1;
            else    
                busy = 0;
        }
        else
        {
            busy = 1;
        }
        
        if(--count == 0)
        {
            ret = F_OPR_ErrTO;
            break;
        }
        delay_ms(5);
    }

    return (ret);
}

/* erase time > 150ms */
static uint8_t w25qxxx_EraseSector(uint32_t sector)
{
    uint32_t addr = sector * QFlash.sectorSize;
    uint8_t ret = F_OPR_ERR;

    if(w25qxxx_WriteEnableState() == 0)
    {
        if(w25qxxx_WriteEnable() != F_OPR_OK)
            return F_OPR_ErrWDIS;
    }

    if(sector >= QFlash.totalSector)
        return F_OPR_ErrSIZE;
        
    /* send erase command */
    ret = qspi_SendCommand(W25Q_SECTOR_ERASE, addr, 
                            0, QSPI_INSTRUCTION_4_LINES, 
                            QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_32_BITS, 
                            QSPI_DATA_4_LINES);
    /* send command error */ 
    if(ret != F_OPR_OK) return (F_OPR_ErrCMD);
    
    /* wait erase done */
    ret = w25qxxx_WaitBusy();
    if(ret != F_OPR_OK) return (F_OPR_ERR);
    
    return F_OPR_OK;
}

/* QSPI Only */
static uint8_t w25qxxx_Read(uint8_t *pBuff, uint32_t Addr, uint16_t rSize)
{
    uint8_t ret = F_OPR_ERR;

    if(QFlash.SPIMode == F_SerialQUADSPI)
    {
        /* send read command */
        ret = qspi_SendCommand(W25Q_FAST_READ, Addr, 
                                8, QSPI_INSTRUCTION_4_LINES, 
                                QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_32_BITS, 
                                QSPI_DATA_4_LINES);
        /* send command error */ 
        if(ret != F_OPR_OK) return (F_OPR_ErrCMD);
        /* QSPI receive data */
        if(qspi_Receive(pBuff, rSize) == F_SPI_OK)
            return F_OPR_OK;
        else
            return F_OPR_ERR;
    }
    else
    {
        return F_OPR_ErrSPI;
    }    
}

/*
*   write one page, wSize <= 256, the data in target page must be '0xFF' before write  
*   QSPI Only
*/
static uint8_t w25qxxx_WritePage(uint32_t Addr, uint8_t *pBuff, uint16_t wSize)
{
    uint8_t ret = F_OPR_ERR;

    if(w25qxxx_WriteEnableState() == 0)
    {
        if(w25qxxx_WriteEnable() != F_OPR_OK)
            return F_OPR_ErrWDIS;
    }

    if(wSize >= QFlash.pageSize)
        return F_OPR_ErrSIZE;
    /* send page program command */
    ret = qspi_SendCommand(W25Q_PAGE_PROGRAM, Addr, 
                            0, QSPI_INSTRUCTION_4_LINES, 
                            QSPI_ADDRESS_4_LINES, QSPI_ADDRESS_24_BITS, 
                            QSPI_DATA_4_LINES);
    /* QSPI send data */
    if(qspi_Transmit(pBuff, wSize) == F_SPI_OK)
    {
        ret = w25qxxx_WaitBusy();
		printf("w25qxxx_WaitBusy, ret = %d", ret);
        /* wait busy error */
        if(ret != F_OPR_OK) 
            return (ret);
        else
            return F_OPR_OK;
    }
    else
    {
        return F_OPR_ERR;
    }
}

/*
*   call in HAL_QSPI_Init();
*/
void HAL_QSPI_MspInit(QSPI_HandleTypeDef *hqspi)
{
    GPIO_InitTypeDef GPIO_Init;
    
    __HAL_RCC_QSPI_CLK_ENABLE();       
    __HAL_RCC_GPIOB_CLK_ENABLE();      
    __HAL_RCC_GPIOF_CLK_ENABLE();      
    
    GPIO_Init.Pin = GPIO_PIN_6;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;        
    GPIO_Init.Pull = GPIO_PULLUP;              
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;  
    GPIO_Init.Alternate = GPIO_AF10_QUADSPI;   
    HAL_GPIO_Init(GPIOB, &GPIO_Init);
    
    GPIO_Init.Pin = GPIO_PIN_8 | GPIO_PIN_9;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_NOPULL;              
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;   
    GPIO_Init.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init(GPIOF, &GPIO_Init);
    
    GPIO_Init.Pin = GPIO_PIN_2;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_NOPULL; 
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_Init.Alternate = GPIO_AF9_QUADSPI;   
    HAL_GPIO_Init(GPIOB, &GPIO_Init);
    
    GPIO_Init.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_Init.Mode = GPIO_MODE_AF_PP;
    GPIO_Init.Pull = GPIO_NOPULL; 
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_Init.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &GPIO_Init);    
}

