nusschAngE/stm32h7xx/hardware/flash/qspi_flash.c
/*
*   w25qxxx controler initialize
**/
static void qspiflash_ControllerInit(void)
{
    QSPI_Handler.Instance = QUADSPI;

    QSPI_Handler.Init.ClockPrescaler = 1; //QSPI clock frequency -> 200/(CP + 1) = 100mhz
    QSPI_Handler.Init.FifoThreshold = 4;
    QSPI_Handler.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;//must set 0 in DDR mode
    QSPI_Handler.Init.FlashSize = (QFLASH_SIZE - 1);
    QSPI_Handler.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_6_CYCLE;//55ns
    QSPI_Handler.Init.ClockMode = QSPI_CLOCK_MODE_0;
    QSPI_Handler.Init.FlashID = QSPI_FLASH_ID_1;
    QSPI_Handler.Init.DualFlash = QSPI_DUALFLASH_DISABLE;
    HAL_QSPI_Init(&QSPI_Handler);
}

/************************* public function ****************************/
void qspiflash_DeviceInit(void)
{
    QFlash.id = 0;
    QFlash.memorySize = 0; //total bytes
    QFlash.pageSize = 0;   //bytes per page
    QFlash.sectorSize = 0; //bytes per sector
    QFlash.totalSector = 0;
    QFlash.blockSize = 0;  //bytes per block   
    QFlash.totalBlock = 0;
    QFlash.SPIMode = F_SerialSPI;
    QFlash.AddressMode = F_ADDR_3B;
    QFlash.bWrite = 0;//write enable?
    QFlash.pWrite = 0;//write protect?
    QFlash.state = F_STA_INIT;
}

/* w25qxxx init */
void qspiflash_init(void)
{
	uint8_t ret = 0;
    /* QSPI initialize */
    qspiflash_ControllerInit();
    /* delay short time */
    ShortDelay(100);
    qspiflash_DeviceInit();
    /* enable write operate */
    ret = w25qxxx_WriteEnable();
    printf("enable write operate, ret = %d\r\n", ret);

    /* enable QSPI mode */
    ret = w25qxxx_QSPI_Enable();
    printf("enable QSPI mode, ret = %d, spi mode = %d\r\n", ret, QFlash.SPIMode);

    /* get flash id */
    ret = w25qxxx_GetDeviceID();
    printf("get flash id, ret = %d, id = 0x%04x\r\n", ret, QFlash.id);
    
    /* update flash device */
    switch (QFlash.id)
    {
        case 0xEF13://W25Q80
            printf("ID : 0x%04x, device unsupport!\r\n", QFlash.id);
            break;
        case 0xEF14://W25Q16
            printf("ID : 0x%04x, device unsupport!\r\n", QFlash.id);
            break;
        case 0xEF15://W25Q32
            printf("ID : 0x%04x, device unsupport!\r\n", QFlash.id);
            break;
        case 0xEF16://W25Q64
            printf("ID : 0x%04x, device unsupport!\r\n", QFlash.id);
            break;
        case 0xEF17://W25Q128
            printf("ID : 0x%04x, device unsupport!\r\n", QFlash.id);
            break;
        case 0xEF18://W25Q256
            printf("ID : 0x%04x, device support!\r\n", QFlash.id);
            QFlash.memorySize = QFLASH_SIZE;//32Mbyte
            QFlash.pageSize = QFLASH_PAGESIZE;//256Byte
            QFlash.sectorSize = QFLASH_SECTORSIZE;//4Kbyte
            QFlash.totalSector = QFLASH_SIZE / QFLASH_SECTORSIZE;//8192
            QFlash.blockSize = QFLASH_BLOCKSIZE;//64Kbyte
            QFlash.totalBlock = QFLASH_SIZE / QFLASH_BLOCKSIZE;//512
            QFlash.state = F_STA_OK;
            break;
        default :
            printf("ID : 0x%04x, device unknow!\r\n", QFlash.id);
            break;
    }

    /* set 4byte address mode */
    //ret = w25qxxx_SetAddressMode(F_ADDR_4B);
    //printf("address mode = %d\r\n", ret);  

    /* set read parameter */
    ret = w25qxxx_SetReadParameter(3, 0);
    printf("set read parameter, ret = %d\r\n", ret);
}

uint8_t qspiflash_EraseSectors(uint32_t sectorAddr, uint32_t sectorNbr)
{
    uint8_t ret, NeedErase = 0;
    //uint8_t tempBuf[4096];//too big , must be careful
    uint16_t i;

    if(sectorAddr >= QFlash.totalSector)
    {
        return F_OPR_ErrADDR;
    }

    while(sectorNbr)
    {
        memset(OPRBUFFER, 0, QFLASH_SECTORSIZE);
        
        ret = w25qxxx_Read(OPRBUFFER, (sectorAddr * QFlash.sectorSize), QFlash.sectorSize);//read 1sector for check
        if(ret != F_OPR_OK)
        {
            return ret;
        }
        /* check read out data */
        for(i = 0; i < QFlash.sectorSize; i++)
        {
            if(OPRBUFFER[i] != 0xff)
            {
                NeedErase = 1;
                break;
            }
        }

        if(NeedErase)
        {
            ret = w25qxxx_EraseSector(sectorAddr);
            if(ret != F_OPR_OK)
            {
                return ret;
            }
        }
        sectorAddr++;
        sectorNbr--;
    }

    return F_OPR_OK;
}

#if 0
/* SPI flash write sector */
uint8_t SPIFlash_ReadMultipleSectors(uint8_t *pBuff, uint32_t StartSector, uint32_t SectorNbr, uint32_t rSize)
{
    
}
#endif

/* SPI flash read */
uint8_t qspiflash_read(uint8_t *pBuff, uint32_t Addr, uint16_t rSize)
{
    return w25qxxx_Read(pBuff, Addr, rSize);
}

#if 0
/* SPI flash write sector */
uint8_t SPIFlash_WriteMultipleSectors(uint8_t *pBuff, uint32_t StartSector, uint32_t SectorNbr, uint8_t wSize)
{
    uint32_t relSector, wSector;
    uint32_t relSize, curSize;

    if(StartSector >= SPIFlash.totalSector)
    {
        return F_OPR_ErrADDR;
    }

    relSize = wSize;
    wSector = StartSector;
    while(relSize && SectorNbr)
    {
        if(relSize >= SPIFlash.sectorSize)
            curSize = SPIFlash.sectorSize
        else
            curSize = relSize;
        /* write sector */
        if(w25qxxx_WriteSector(&SPIFlash, pBuff, wSector, curSize, 1) != F_OPR_OK)
        {
            return F_OPR_ErrWS;
        }
        /* next sector */
        wSector++;
        /* sector be written */
        SectorNbr--;
        if(wSector >= SPIFlash.totalSector)
        {
            return F_OPR_ERR;
        }
        /* buffer pointer of next sector */
        pBuff += curSize;
        /* size of buffer be written */
        relSize -= curSize;
    }

    return F_OPR_OK;
}
#endif


/* SPI Flash write, not check */
uint8_t qspiflash_write(uint8_t *pBuff, uint32_t Addr, uint32_t wSize)
{
    uint32_t relSize, curSize;

    if(Addr >= QFlash.memorySize)
    {
        return F_OPR_ErrADDR;
    }

    relSize = wSize;
    while(relSize)
    {
        if(relSize >= QFlash.pageSize)
            curSize = QFlash.pageSize;
        else
            curSize = relSize;

        if(w25qxxx_WritePage(Addr, pBuff, curSize) != F_OPR_OK)
        {
            return F_OPR_ERR;
        }

