nusschAngE/stm32h7xx/hardware/flash/qspi_flash.c
        pBuff += curSize;
        relSize -= curSize;
        Addr += curSize;
    }

    return F_OPR_OK;
}


/* SPI Flash write with check*/
uint8_t qspiflash_WriteWithErase(uint8_t *pBuff, uint32_t Addr, uint32_t wSize)
{
    uint32_t procSector, i;
    uint32_t relSize, curSize;
    uint32_t posit, wpSize, wpRelSize, procSize; 
    uint32_t procAddr;
    uint8_t NeedErase = 0;
    uint8_t *pWrite = NULL;

    //uint8_t tempBuf[4096];//too big , must be careful

    if(Addr >= QFlash.memorySize)
    {
        return F_OPR_ErrADDR;
    }
    
    memset(OPRBUFFER, 0, QFLASH_SECTORSIZE);

    relSize = wSize;//number byte to write
    while(relSize)
    {
        procSector = Addr / QFlash.sectorSize;//the address is included in which sector 
        posit = Addr % QFlash.sectorSize;//the posit of the address in sector
        if(procSector >= QFlash.totalSector)
        {
            return F_OPR_ERR;
        }
        
        /* read the sector */
        if(w25qxxx_Read(OPRBUFFER, (procSector * QFlash.sectorSize), QFlash.sectorSize) != F_OPR_OK)
        {
            return F_OPR_ErrREAD;
        }
        /* check the sector */
        for(i = posit; i < QFlash.sectorSize; i++)
        {
            if(OPRBUFFER[i] != 0xff)
            {   
                /* need erase */
                NeedErase = 1;
                break;
            }
        }
        
        if(NeedErase)
        {
            /* erase sector */
            if(w25qxxx_EraseSector(procSector) != F_OPR_OK)
            {
                return F_OPR_ErrES;
            }
            wpRelSize = QFlash.sectorSize;//need write the whole sector
            procAddr = procSector * QFlash.sectorSize;//page program address
        }
        else
        {
            wpRelSize = QFlash.sectorSize - posit;//just write the new data only
            procAddr = Addr;//page program address
        }

        /* field cacheBuff with pBuff */
        for(i = posit; i < QFlash.sectorSize; i++)
        {
            OPRBUFFER[i] = *pBuff;
            pBuff++;
        }

        pWrite = &OPRBUFFER[posit];//get write buffer on current tune
        relSize -= wpRelSize;//current size be written
        Addr += wpRelSize;//update address for next tune
        
        /* page program */
        while(wpRelSize)
        {
            if(wpRelSize >= QFlash.pageSize)
                wpSize = QFlash.pageSize;
            else
                wpSize = wpRelSize;

            if(w25qxxx_WritePage(procAddr, pWrite, wpSize) != F_OPR_OK)
            {
                return F_OPR_ERR;
            }
            pWrite += wpSize;
            procAddr += wpSize;
            wpRelSize -= wpSize;
        }
    }

    return F_OPR_OK;
}

/* spi flash test */
void qspiflash_RWTest(void)
{
    uint8_t testBuff[256];
    uint16_t i;
    uint8_t ret;

    for(i = 0; i < 256; i++)
    {
        testBuff[i] = i;
    }
    
    printf("SPIFlash_RWTest start...\r\n");
    ret = qspiflash_write(testBuff, 0, 256);
    if(ret != F_OPR_OK)
    {
        printf("SPIFlash_RWTest write error, ret = %d\r\n", ret);
        return ;
    }

    for(i = 0; i < 256; i++)
    {
        testBuff[i] = 0;
    }
    ret = qspiflash_read(testBuff, 0, 256);
    if(ret != F_OPR_OK)
    {
        printf("SPIFlash_RWTest read error, ret = %d\r\n", ret);
        return ;
    }
    printf("SPIFlash_RWTest finish...\r\n");
}

